OdDAI.Entity.rfindAttribute(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
For entity definition and all its supertypes tries to find Attribute definition with name attrName in reversed order.
\param attrName [in] An ANSI string that contains the name of the attribute to find.
\returns A smart pointer to the found attribute definition; if the attribute is not found the nullptr value is returned.
\remarks The searching of attribute is performed starting from this entity definition towards its supertypes.

OdDAI.Entity.findAttribute(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
For entity definition and all its supertypes tries to find Attribute definition with name attrName.
\param attrName [in] An ANSI string that contains the name of the attribute to find.
\returns A smart pointer to the found attribute definition; if the attribute is not found the nullptr value is returned.
\remarks The searching of attribute is performed starting from most base entity definition towards its subtypes (this
entity definition).

OdDAI.Entity.isSupertypeOf(OdDAI.Entity!System.Runtime.CompilerServices.IsConst*)
\details
Check whether the entity is a supertype of another entity.
\param subtypeToCheck [in] An entity subtype to check.
\returns true if the object is a supertype of the specified entity type; otherwise, the method returns false.

OdDAI.Entity.createObject(OdDAI.Schema*,System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*,System.Boolean)
\details
Creates a new entity definition with a specified owning schema, name instantiable values.
\param owningSchema [in] Schema in which entity definition is declared.
\param entityName   [in] An entity definition name.
\param instantiable [in] A flag that defines whether the entity can be instantiated (equal to true) or not (equal to false).
\returns A smart pointer to the created entity.